bench-results/local-raw-nvme-pgbench-saturation-20260806T000458Z/prepared-c256-j16-r1.log
pgbench (17.10 (Debian 17.10-0+deb13u1))
starting vacuum...end.
progress: 5.0 s, 44976.3 tps, lat 5.504 ms stddev 5.795, 0 failed
progress: 10.0 s, 48043.1 tps, lat 5.328 ms stddev 5.613, 0 failed
progress: 15.0 s, 44523.8 tps, lat 5.747 ms stddev 6.174, 0 failed
progress: 20.0 s, 47131.6 tps, lat 5.431 ms stddev 5.676, 0 failed
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 100
query mode: prepared
number of clients: 256
number of threads: 16
maximum number of tries: 1
duration: 20 s
number of transactions actually processed: 923633
number of failed transactions: 0 (0.000%)
latency average = 5.501 ms
latency stddev = 5.820 ms
initial connection time = 158.742 ms
tps = 46485.860444 (without initial connection time)
statement latencies in milliseconds and failures:
         0.000           0  \set aid random(1, 100000 * :scale)
         0.000           0  \set bid random(1, 1 * :scale)
         0.000           0  \set tid random(1, 10 * :scale)
         0.000           0  \set delta random(-5000, 5000)
         0.051           0  BEGIN;
         0.084           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.058           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         1.096           0  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         2.655           0  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.056           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
         1.501           0  END;